import React from 'react';

const AboutPage = () => {
    return (

        <div style={{ padding: '20px', fontFamily: 'Arial, sans-serif' }}>

            <header style={{ marginBottom: '20px' }}>
                <h1 className='text-center py-6 font-bold text-4xl text-black bg-blue-200 shadow-xl rounded-lg'>เกี่ยวกับเรา</h1>
            </header>
            <div className="text-black text-left mb-5 bg-white shadow-xl rounded-lg">
                <section>
                    <p className='text-justify px-4 py-2'>
                        ในปัจจุบัน โรคไม่ติดต่อเรื้อรัง (NCDs) โดยเฉพาะ โรคเบาหวาน และ ความดันโลหิตสูง ได้
                        กลายเป็นปัญหาสำคัญระดับโลก ซึ่งไม่เพียงส่งผลกระทบต่อสุขภาพของผู้ป่วย แต่ยังเพิ่มภาระค่าใช้จ่าย
                        ในการรักษาและลดคุณภาพชีวิตของพวกเขา ผู้ป่วยจำนวนมากต้องเผชิญกับความซับซ้อนในการจัดการ
                        ตนเอง เช่น การควบคุมระดับน้ำตาลในเลือด การติดตามความดันโลหิต และการปรับพฤติกรรมการใช้
                        ชีวิต เพื่อป้องกันภาวะแทรกซ้อน
                        แม้ว่าจะมีแอปพลิเคชันด้านสุขภาพหลายตัวที่เน้นช่วยเหลือผู้ป่วยโรคเบาหวานหรือความดันโลหิตสูง
                        แยกกัน แต่กลับ ขาดการออกแบบที่ครอบคลุมและตอบโจทย์ สำหรับผู้ป่วยที่มีทั้งสองโรคพร้อมกัน ซึ่ง
                        มักพบว่ากลุ่มผู้ป่วยเหล่านี้มีความเสี่ยงสูงต่อภาวะแทรกซ้อนร้ายแรง เช่น โรคหัวใจและหลอดเลือด ตา
                        บอด หรือไตวาย อีกทั้ง แอปพลิเคชันส่วนใหญ่ในปัจจุบันยังใช้วิธีบันทึกข้อมูลย้อนหลัง และไม่ได้ให้
                        คำแนะนำเชิงลึกที่ปรับเฉพาะสำหรับแต่ละบุคคล
                        ดูแลกัน
                        (Care Together)
                        คือแอปพลิเคชันที่ออกแบบมาเพื่อสนับสนุนการดูแลผู้สูงอายุใน
                        ชีวิตประจำวัน โดยมุ่งเน้นให้ผู้ดูแลสามารถจัดการและติดตามสุขภาพของผู้สูงอายุได้อย่างง่ายดายและมี
                        ประสิทธิภาพ แอปพลิเคชันนี้เหมาะสำหรับผู้ดูแลผู้สูงอายุทุกประเภท ไม่ว่าจะเป็นลูกหลานที่ดูแลพ่อแม่
                        ผู้ช่วยดูแล หรือแม้กระทั่งผู้เชี่ยวชาญที่ทำงานในสถานดูแลผู้สูงอายุ
                    </p>
                </section>
            </div>

            <section>
                <div className='h-12 bg-blue-200 px-4 font-bold text-2xl  shadow-xl rounded-lg text-black'><div className='py-2'>เทคโนโลยีที่เราใช้ในการให้คำแนะนำ</div></div>
                <div className=' py-4 grid grid-cols-2 gap-4'>
                    <div className='bg-white shadow-xl rounded-lg px-4 h-48'>
                        <div className='text-center py-2 text-xl font-semibold'>หลักการคำนวณผลลัพท์ด้วย Association Rule</div>
                        <div>ระบบจะคำนวณค่าสุขภาพต่างๆ เช่น น้ำหนัก, ส่วนสูง, ระดับน้ำตาลในเลือด และค่าความดัน โลหิต แล้ววิเคราะห์ผลลัพท์ได้อย่างรวดเร็วบน มือถือของคุณโดยไม่เปลืองทรัพยากรเครื่อง</div>
                    </div>
                    <div className='bg-white shadow-xl rounded-lg px-4 h-48'>
                        <div className='text-center py-2 text-xl font-semibold'>ระบบให้คำแนะนำ เสริมข้อมูลด้วย Machine Learning</div>
                        <div>คลังคำแนะนำของเราพัฒนามาจากข้อมูลที่ได้รับ มาจากแพทย์และผู้เชี่ยวชาญที่มีประสบการณ์ดูแล ผู้ป่วยเบาหวานความดันสูง ระบบของเราจะจัดการ คัดกรองข้อมูลที่สำคัญในแต่ละสถาณะของผู้ใช้ และเสนอคำแนะนำที่ดีที่สุด</div>
                    </div>
                </div>
            </section>
        </div>
    );
};

export default AboutPage;